part of pisey_ui_kits;

class MyTextString {
  static const title =
      'សម្ដេច​ព្រះ​មហា​សុមេធាធិបតី ជួន ណាត (ជោតញ្ញាណោ) សម្ដេច​ព្រះ​សង្ឃ​រាជ​ថ្នាក់​ទី​១ នៃ​គណៈ​មហា​និកាយ (ប្រសូត ១១ មីនា ព.ស.​២៤២៧/គ.ស.​១៨៨៣ សុគត ២៥ កញ្ញា ព.ស.​២៥១៣/គ.ស.​១៩៦៩) ជា​សម្ដេច​ព្រះ​សង្ឃ​រាជ​អង្គ​ទី​៤ នៃ​គណៈ​មហានិកាយ';
  static const url =
      'https://www.interconrooster.com/wp-content/uploads/2018/06/chunnat_biopng.png';
  static const subtitle =
      'សម្ដេច​ព្រះសង្ឃរាជ ទ្រង់​ប្រសូត​នៅ​ថ្ងៃ​អង្គារ ១១​រោច ខែ​ផល្គុន ឆ្នាំ​វក ឆ​ស័ក ព.ស.​២៤២៧ គឺ​ថ្ងៃ​ទី​១១ ខែ មីនា គ.ស.​១៨៨៣ នៅ​ភូមិ​កំរៀង សង្កាត់​រកា​កោះ ស្រុក​គង​ពិសី ខេត្ត​កំពង់​ស្ពឺ។ សម្ដេច​មាន​ព្រះជាតិ​ក្នុង​ត្រកូល​កសិករ ព្រះ​មាតា​នៃ​សម្ដេច​នាម យក់ ព្រះ​បិតា​នាម ព្រហ្ម ជួន។ គ្រួសារ​នេះ​មាន​បុត្រ​តែ​ពីរ​នាក់​គឺ អង្គ​សម្ដេច​ព្រះសង្ឃរាជ និង​លោក​ឧកញ៉ា​សោភណ្ឌ​មន្ត្រី ជួន នុត ជា​ព្រះ​អនុជ​នៃ សម្ដេច​ព្រះសង្ឃ​រាជ។';
}
